# ðŸ“˜ Content from `01-Series.ipynb`


# Series

The first main data type we will learn about for pandas is the Series data type. Let's import Pandas and explore the Series object.

A Series is very similar to a python list (in fact it is built on top of the NumPy array object). What differentiates the NumPy array from a Series, is that a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location. It also doesn't need to hold numeric data, it can hold any arbitrary Python Object.

Let's explore this concept through some examples:

In [ ]:
!pip install pandas seaborn

In [1]:
import pandas as pd

### Creating a Series

You can convert a list,numpy array, or dictionary to a Series:

In [2]:
labels = ['a','b','c']
my_list = [10,20,30]
d = {'a':10,'b':20,'c':30}
my_list

[10, 20, 30]

** Using Lists**

In [3]:
ser1 = pd.Series(data=my_list)
ser1

0    10
1    20
2    30
dtype: int64

In [4]:
type(ser1)

pandas.core.series.Series

In [5]:
pd.Series(data=my_list,index=['a','b','c'])

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

** NumPy Arrays **

In [7]:
import numpy as np
arr = np.array(my_list)

pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [8]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

** Dictionary**

In [9]:
d = {'a':10,'b':20,'c':30}
pd.Series(d)

a    10
b    20
c    30
dtype: int64

### Data in a Series

A pandas Series can hold a variety of object types:

In [10]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [11]:
# Even functions (although unlikely that you will use this)
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

## Using an Index

The key to using a Series is understanding its index. Pandas makes use of these index names or numbers by allowing for fast look ups of information (works like a hash table or dictionary).

Let's see some examples of how to grab information from a Series. Let us create two sereis, ser1 and ser2:

In [12]:
ser1 = pd.Series(data=[1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])

In [13]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [14]:
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])

In [15]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [16]:
ser1['USA']

1

Operations are then also done based off of index:

In [17]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [18]:
ser1 = pd.Series([1,2,3,4,5],index = ['USA', 'Germany','USSR', 'Japan','India'])

In [19]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
India      5
dtype: int64

In [20]:
ser1.India
ser1['India']

5

In [21]:
print(ser1.cumsum())
print(ser1.shape)

USA         1
Germany     3
USSR        6
Japan      10
India      15
dtype: int64
(5,)

In [22]:
print(ser1.min())
print(ser1.max())
print(ser1.median())
print(ser1.mode())

1
5
3.0
0    1
1    2
2    3
3    4
4    5
dtype: int64

In [23]:
ser1.dtype

dtype('int64')

In [24]:
ser2 = pd.Series(data = ['USA', 'Germany','USSR', 'Japan','India'],index = [1,2,3,4,5])
ser2

1        USA
2    Germany
3       USSR
4      Japan
5      India
dtype: object

In [25]:
ser2.dtype

dtype('O')

# ---
# ðŸ“˜ Content from `03-DataFrames.ipynb`
# ---

# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [26]:
import pandas as pd
import numpy as np

In [27]:
my_lst = [[1,2,3,4,5], [6,7,8,9,10]]

df = pd.DataFrame(my_lst, columns=['col1','col2','col3','col4', 'col5'])
df

   col1  col2  col3  col4  col5
0     1     2     3     4     5
1     6     7     8     9    10

In [28]:
my_dict = {"col1":[1,2,3,4,5], "col2":[6,7,8,9,10]}

pd.DataFrame(my_dict)

   col1  col2
0     1     6
1     2     7
2     3     8
3     4     9
4     5    10

In [29]:
from numpy.random import randn
np.random.seed(101)

In [30]:
'W X Y Z'.split()

['W', 'X', 'Y', 'Z']

In [31]:
randn(5,4)

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [32]:
df = pd.DataFrame(randn(5,4),index=['A', 'B', 'C', 'D', 'E'],columns=['W', 'X', 'Y', 'Z'])

In [33]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [34]:
df['W']
# df.W

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [35]:
df['W','Y']

KeyError: ('W', 'Y')

In [36]:
# Pass a list of column names
df[['W','Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [37]:
# SQL Syntax (NOT RECOMMENDED!)
df.W

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

DataFrame Columns are just Series

In [38]:
type(df['W'])

pandas.core.series.Series

In [39]:
df['W'].dtype

dtype('float64')

In [40]:
df['W'] + df['Y']

A   -1.403420
B    0.032064
C    1.446493
D   -1.440510
E    0.121354
dtype: float64

**Creating a new column:**

In [41]:
df['new'] = df['W'] + df['Y']

In [42]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

** Removing Columns**

In [43]:
df.drop('new')

KeyError: "['new'] not found in axis"

In [44]:
df.drop('new', axis='columns')  # default looks into rows , axis=1

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [45]:
# Not inplace unless specified!
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [46]:
df.drop('new',axis=1,inplace=True)  # permanently drop it

In [47]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

Can also drop rows this way:

In [48]:
df.drop('E' ,axis=0) # inplace=True # 0 == rows 1 == columns

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [49]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

** Selecting Rows**

In [50]:
df['A']

KeyError: 'A'

In [51]:
df.loc['A']

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [52]:
df.loc[['A','B']]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502

Or select based off of position instead of label

In [53]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [54]:
df.iloc[0]  # index

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

** Selecting subset of rows and columns **

In [55]:
df.loc['B','X']

0.39052784273374097

In [56]:
df.loc[['B','C'],['X','Y']]

          X         Y
B  0.390528  0.166905
C  0.072960  0.638787

In [57]:
df.iloc[[1,2],[1,2]]

          X         Y
B  0.390528  0.166905
C  0.072960  0.638787

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [58]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [59]:
df>1

       W      X      Y      Z
A  False   True  False  False
B  False  False  False  False
C  False  False  False  False
D  False  False  False  False
E  False   True  False   True

In [37]:
df[df>1]

    W         X   Y         Z
A NaN  1.693723 NaN       NaN
B NaN       NaN NaN       NaN
C NaN       NaN NaN       NaN
D NaN       NaN NaN       NaN
E NaN  1.901755 NaN  1.996652

In [60]:
df['W']>0

A     True
B    False
C     True
D    False
E    False
Name: W, dtype: bool

In [61]:
df[df['W']>0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [62]:
df[df['W']>0]['Y']

A   -1.706086
C    0.638787
Name: Y, dtype: float64

In [63]:
df[df['W']>0][['Y','X']]

          Y         X
A -1.706086  1.693723
C  0.638787  0.072960

For two conditions you can use | and & with parenthesis:

In [64]:
df[df['W']>0 & df['Y'] > 1]

TypeError: Cannot perform 'rand_' with a dtyped [float64] array and scalar of type [bool]

In [65]:
df[(df['W']>0) & (df['Y'] > 0)]

          W        X         Y         Z
C  0.807706  0.07296  0.638787  0.329646

In [66]:
df[(df['W'] < 0) & (df['Y'] < 0)]

          W        X         Y         Z
D -0.497104 -0.75407 -0.943406  0.484752

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [67]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [68]:
# Reset to default 0,1...n index
df.reset_index()   # drop=True  removes the index column
# df.reset_index(drop=True)

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [69]:
newind = 'CA NY WY OR CO'.split()

In [70]:
df['States'] = newind

In [71]:
df

          W         X         Y         Z States
A  0.302665  1.693723 -1.706086 -1.159119     CA
B -0.134841  0.390528  0.166905  0.184502     NY
C  0.807706  0.072960  0.638787  0.329646     WY
D -0.497104 -0.754070 -0.943406  0.484752     OR
E -0.116773  1.901755  0.238127  1.996652     CO

In [54]:
df.set_index('States')

               W         X         Y         Z
States
CA      0.302665  1.693723 -1.706086 -1.159119
NY     -0.134841  0.390528  0.166905  0.184502
WY      0.807706  0.072960  0.638787  0.329646
OR     -0.497104 -0.754070 -0.943406  0.484752
CO     -0.116773  1.901755  0.238127  1.996652

In [72]:
df

          W         X         Y         Z States
A  0.302665  1.693723 -1.706086 -1.159119     CA
B -0.134841  0.390528  0.166905  0.184502     NY
C  0.807706  0.072960  0.638787  0.329646     WY
D -0.497104 -0.754070 -0.943406  0.484752     OR
E -0.116773  1.901755  0.238127  1.996652     CO

In [73]:
df.set_index('States',inplace=True)

In [74]:
df

               W         X         Y         Z
States
CA      0.302665  1.693723 -1.706086 -1.159119
NY     -0.134841  0.390528  0.166905  0.184502
WY      0.807706  0.072960  0.638787  0.329646
OR     -0.497104 -0.754070 -0.943406  0.484752
CO     -0.116773  1.901755  0.238127  1.996652

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [75]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [76]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [77]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1 -0.993263  0.196800
   2 -1.136645  0.000366
   3  1.025984 -0.156598
G2 1 -0.031579  0.649826
   2  2.154846 -0.610259
   3 -0.755325 -0.346419

In [78]:
# df.groupby(['outside','inside'])['inside']

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [79]:
df.loc['G1']

          A         B
1 -0.993263  0.196800
2 -1.136645  0.000366
3  1.025984 -0.156598

In [80]:
df.loc['G1'].loc[1]

A   -0.993263
B    0.196800
Name: 1, dtype: float64

In [81]:
df.loc['G1'].loc[1]['B']

0.19679950499134005

In [82]:
df.index.names

FrozenList([None, None])

In [83]:
df.index.names = ['outer','inner']

In [84]:
df

                    A         B
outer inner
G1    1     -0.993263  0.196800
      2     -1.136645  0.000366
      3      1.025984 -0.156598
G2    1     -0.031579  0.649826
      2      2.154846 -0.610259
      3     -0.755325 -0.346419

In [85]:
df.xs('G1')

              A         B
inner
1     -0.993263  0.196800
2     -1.136645  0.000366
3      1.025984 -0.156598

In [86]:
df.xs(('G1',1))

A   -0.993263
B    0.196800
Name: (G1, 1), dtype: float64

In [87]:
df.xs(1,level='inner')

              A         B
outer
G1    -0.993263  0.196800
G2    -0.031579  0.649826

# ---
# ðŸ“˜ Content from `04-Missing Data.ipynb`
# ---

# Missing Data

Let's show a few convenient methods to deal with Missing Data in pandas:

In [88]:
import numpy as np
import pandas as pd

In [89]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [90]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [92]:
df.isnull().sum()

A    1
B    2
C    0
dtype: int64

In [93]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [94]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [100]:
df.dropna(thresh=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [101]:
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [104]:
data = {
    'product_id': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'product_name': ['Apples', 'Bread', np.nan, 'Milk', 'Eggs', 'Bananas', 'Rice', None, 'Chicken', 'Yogurt'],
    'category': ['Fruits', 'Bakery', 'Vegetables', 'Dairy', None, 'Fruits', 'Grains', 'Meat', 'Meat', 'Dairy'],
    'price': [2.99, 1.50, 3.25, None, 4.99, 1.25, 5.00, 8.99, None, 3.50],
    'quantity_sold': [45, None, 23, 67, 34, 89, 12, 56, 78, None],
    'supplier': ['Farm Fresh', 'Local Bakery', 'Green Garden', None, 'Happy Hens', 'Tropical Inc', 'Rice Co', 'Fresh Meat', 'Premium Poultry', None],
    'expiry_date': ['2024-10-15', '2024-09-25', None, '2024-09-28', '2024-09-30', '2024-10-01', '2025-06-15', '2024-10-05', None, '2024-09-27'],
    'in_stock': [True, True, False, True, None, True, True, False, True, True],
    'discount_percent': [10, 0, 15, 5, None, 20, 0, None, 12, 8]
}

grocery_df = pd.DataFrame(data)
grocery_df

,product_id,product_name,category,price,quantity_sold,supplier,expiry_date,in_stock,discount_percent
0,1,Apples,Fruits,2.99,45.0,Farm Fresh,2024-10-15,True,10.0
1,2,Bread,Bakery,1.50,NaN,Local Bakery,2024-09-25,True,0.0
2,3,NaN,Vegetables,3.25,23.0,Green Garden,None,False,15.0
3,4,Milk,Dairy,NaN,67.0,None,2024-09-28,True,5.0
4,5,Eggs,None,4.99,34.0,Happy Hens,2024-09-30,None,NaN
5,6,Bananas,Fruits,1.25,89.0,Tropical Inc,2024-10-01,True,20.0
6,7,Rice,Grains,5.00,12.0,Rice Co,2025-06-15,True,0.0
7,8,None,Meat,8.99,56.0,Fresh Meat,2024-10-05,False,NaN
8,9,Chicken,Meat,NaN,78.0,Premium Poultry,None,True,12.0
9,10,Yogurt,Dairy,3.50,NaN,None,2024-09-27,True,8.0

In [107]:
avg_price = grocery_df['price'].mean()

In [111]:
grocery_df['price'].fillna(value=avg_price, inplace=True)

In [112]:
grocery_df

,product_id,product_name,category,price,quantity_sold,supplier,expiry_date,in_stock,discount_percent
0,1,Apples,Fruits,2.99000,45.0,Farm Fresh,2024-10-15,True,10.0
1,2,Bread,Bakery,1.50000,NaN,Local Bakery,2024-09-25,True,0.0
2,3,NaN,Vegetables,3.25000,23.0,Green Garden,None,False,15.0
3,4,Milk,Dairy,3.93375,67.0,None,2024-09-28,True,5.0
4,5,Eggs,None,4.99000,34.0,Happy Hens,2024-09-30,None,NaN
5,6,Bananas,Fruits,1.25000,89.0,Tropical Inc,2024-10-01,True,20.0
6,7,Rice,Grains,5.00000,12.0,Rice Co,2025-06-15,True,0.0
7,8,None,Meat,8.99000,56.0,Fresh Meat,2024-10-05,False,NaN
8,9,Chicken,Meat,3.93375,78.0,Premium Poultry,None,True,12.0
9,10,Yogurt,Dairy,3.50000,NaN,None,2024-09-27,True,8.0

In [ ]:
A_avg = df['A'].mean()

df['A'].fillna(value=A_avg)

# ---
# ðŸ“˜ Content from `05-Groupby.ipynb`
# ---

# GroupBy

In [113]:
import pandas as pd
# Create dataframe
grocery_df

,product_id,product_name,category,price,quantity_sold,supplier,expiry_date,in_stock,discount_percent
0,1,Apples,Fruits,2.99000,45.0,Farm Fresh,2024-10-15,True,10.0
1,2,Bread,Bakery,1.50000,NaN,Local Bakery,2024-09-25,True,0.0
2,3,NaN,Vegetables,3.25000,23.0,Green Garden,None,False,15.0
3,4,Milk,Dairy,3.93375,67.0,None,2024-09-28,True,5.0
4,5,Eggs,None,4.99000,34.0,Happy Hens,2024-09-30,None,NaN
5,6,Bananas,Fruits,1.25000,89.0,Tropical Inc,2024-10-01,True,20.0
6,7,Rice,Grains,5.00000,12.0,Rice Co,2025-06-15,True,0.0
7,8,None,Meat,8.99000,56.0,Fresh Meat,2024-10-05,False,NaN
8,9,Chicken,Meat,3.93375,78.0,Premium Poultry,None,True,12.0
9,10,Yogurt,Dairy,3.50000,NaN,None,2024-09-27,True,8.0

In [117]:
grocery_df[['category','price']].groupby(['category']).sum('price')

               price
category
Bakery       1.50000
Dairy        7.43375
Fruits       4.24000
Grains       5.00000
Meat        12.92375
Vegetables   3.25000

** Now you can use the .groupby() method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:**

You can save this object as a new variable:

And then call aggregate methods off the object:

In [118]:
grocery_df.groupby('quantity_sold').mean()

TypeError: agg function failed [how->mean,dtype->object]

More examples of aggregate methods:

In [120]:
grocery_df['price'].std()

2.1728165924542377

In [121]:
grocery_df['price'].min()

1.25

In [122]:
grocery_df['price'].max()

8.99

In [123]:
grocery_df['price'].count()

10

In [124]:
grocery_df.describe()

       product_id      price  quantity_sold  discount_percent
count    10.00000  10.000000       8.000000          8.000000
mean      5.50000   3.933750      50.500000          8.750000
std       3.02765   2.172817      26.944387          7.025464
min       1.00000   1.250000      12.000000          0.000000
25%       3.25000   3.055000      31.250000          3.750000
50%       5.50000   3.716875      50.500000          9.000000
75%       7.75000   4.725938      69.750000         12.750000
max      10.00000   8.990000      89.000000         20.000000

In [126]:
grocery_df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
product_id,10.0,5.50000,3.027650,1.00,3.250,5.500000,7.750000,10.00
price,10.0,3.93375,2.172817,1.25,3.055,3.716875,4.725938,8.99
quantity_sold,8.0,50.50000,26.944387,12.00,31.250,50.500000,69.750000,89.00
discount_percent,8.0,8.75000,7.025464,0.00,3.750,9.000000,12.750000,20.00

In [130]:
grocery_df.describe().transpose()['mean']

product_id           5.50000
price                3.93375
quantity_sold       50.50000
discount_percent     8.75000
Name: mean, dtype: float64

# ---
# ðŸ“˜ Content from `06-Merging, Joining, and Concatenating.ipynb`
# ---

# Merging, Joining, and Concatenating

There are 3 main ways of combining DataFrames together: Merging, Joining and Concatenating. In this lecture we will discuss these 3 methods with examples.

____

### Example DataFrames

In [ ]:
import pandas as pd

In [131]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [132]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [133]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [134]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [135]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [136]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## Concatenation

Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. You can use **pd.concat** and pass in a list of DataFrames to concatenate together:

In [137]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [138]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

_____
## Example DataFrames

In [139]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']}, index=['K0', 'K1', 'K2', 'K3'])
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']}, index=['K0', 'K1', 'K2', 'K3'])

In [140]:
left

   key   A   B
K0  K0  A0  B0
K1  K1  A1  B1
K2  K2  A2  B2
K3  K3  A3  B3

In [141]:
right

   key   C   D
K0  K0  C0  D0
K1  K1  C1  D1
K2  K2  C2  D2
K3  K3  C3  D3

In [143]:
left.join(right,lsuffix='key')

   keykey   A   B key   C   D
K0     K0  A0  B0  K0  C0  D0
K1     K1  A1  B1  K1  C1  D1
K2     K2  A2  B2  K2  C2  D2
K3     K3  A3  B3  K3  C3  D3

In [ ]:
left.join(right.set_index('key'), lsuffix='key', how='left')

   key   A   B   C   D
K0  K0  A0  B0  C0  D0
K1  K1  A1  B1  C1  D1
K2  K2  A2  B2  C2  D2
K3  K3  A3  B3  C3  D3

___

## Merging

The **merge** function allows you to merge DataFrames together using a similar logic as merging SQL Tables together. For example:

In [145]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

Or to show a more complicated example:

In [147]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                         'C': ['C0', 'C1', 'C2', 'C3'],
                         'D': ['D0', 'D1', 'D2', 'D3']})

In [148]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [149]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [150]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [151]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K0  NaN  NaN   C3   D3
5   K2   K1   A3   B3  NaN  NaN

In [153]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [152]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

## Joining
Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [154]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [155]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [156]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [157]:
res = left.join(right, how='outer')

In [159]:
# res.to_csv(r"C:\Users\v-maheshkur\Downloads\test.csv", index=True)

# ---
# ðŸ“˜ Content from `08-Data Input and Output.ipynb`
# ---

# Data Input and Output

This notebook is the reference code for getting input and output, pandas can read a variety of file types using its pd.read_ methods. Let's take a look at the most common data types:

In [160]:
import numpy as np
import pandas as pd

## CSV

### CSV Input

In [161]:
df = pd.read_csv(r"E:\blinkit_sales\blinkit_customers.csv")
df

,customer_id,customer_name,email,phone,address,area,pincode,registration_date,customer_segment,total_orders,avg_order_value
0,97475543,Niharika Nagi,ektataneja@example.org,912987579691,"23, Nayar Path, Bihar Sharif-154625",Udupi,321865,2023-05-13,Premium,13,451.92
1,22077605,Megha Sachar,vedant45@example.com,915123179717,"51/302, Buch Chowk\nSrinagar-570271",Aligarh,149394,2024-06-18,Inactive,4,825.48
2,47822591,Hema Bahri,samiazaan@example.com,910034076149,"941\nAnne Street, Darbhanga 186125",Begusarai,621411,2024-09-25,Regular,17,1969.81
3,79726146,Zaitra Vig,ishanvi87@example.org,916264232390,"43/94, Ghosh, Alappuzha 635655",Kozhikode,826054,2023-10-04,New,4,220.09
4,57102800,Januja Verma,atideshpande@example.org,917293526596,"06\nOm, Ambarnath 477463",Ichalkaranji,730539,2024-03-22,Inactive,14,578.14
...,...,...,...,...,...,...,...,...,...,...,...
2495,48002829,Daksh Mandal,varkeymohammed@example.com,919587731286,"28/42, Venkataraman Ganj, Kishanganj-360157",Mumbai,45238,2024-01-25,Inactive,17,754.33
2496,57392064,Lavanya Jain,deshpandeom@example.com,916137420258,"391, Edwin Path, Korba 202726",Udupi,688100,2024-06-23,Regular,4,1540.81
2497,71688530,Umang Dash,gokhalenicholas@example.org,917595275963,"151, Parmer Ganj\nLoni 906431",Kavali,528749,2024-03-18,Regular,1,1541.22
2498,89051578,Zinal Natarajan,vyasfrado@example.com,911994009448,"H.No. 172, Khanna Street, Pudukkottai 610564",Alwar,586734,2024-09-06,Premium,12,1185.50
2499,78738569,Eiravati Sundaram,onkar24@example.com,914320353753,"H.No. 791, Sur Path\nBally 982559",Dewas,342448,2023-05-10,Inactive,4,376.50

In [164]:
df.head(2)

,customer_id,customer_name,email,phone,address,area,pincode,registration_date,customer_segment,total_orders,avg_order_value
0,97475543,Niharika Nagi,ektataneja@example.org,912987579691,"23, Nayar Path, Bihar Sharif-154625",Udupi,321865,2023-05-13,Premium,13,451.92
1,22077605,Megha Sachar,vedant45@example.com,915123179717,"51/302, Buch Chowk\nSrinagar-570271",Aligarh,149394,2024-06-18,Inactive,4,825.48

In [163]:
df.tail()

,customer_id,customer_name,email,phone,address,area,pincode,registration_date,customer_segment,total_orders,avg_order_value
2495,48002829,Daksh Mandal,varkeymohammed@example.com,919587731286,"28/42, Venkataraman Ganj, Kishanganj-360157",Mumbai,45238,2024-01-25,Inactive,17,754.33
2496,57392064,Lavanya Jain,deshpandeom@example.com,916137420258,"391, Edwin Path, Korba 202726",Udupi,688100,2024-06-23,Regular,4,1540.81
2497,71688530,Umang Dash,gokhalenicholas@example.org,917595275963,"151, Parmer Ganj\nLoni 906431",Kavali,528749,2024-03-18,Regular,1,1541.22
2498,89051578,Zinal Natarajan,vyasfrado@example.com,911994009448,"H.No. 172, Khanna Street, Pudukkottai 610564",Alwar,586734,2024-09-06,Premium,12,1185.50
2499,78738569,Eiravati Sundaram,onkar24@example.com,914320353753,"H.No. 791, Sur Path\nBally 982559",Dewas,342448,2023-05-10,Inactive,4,376.50

In [166]:
pd.read_html("https://www.the-aiff.com/competitions/isl")

[   Team              Team.1           Points           Played           Won  \
 0   NaN  {{team.team_name}}  {{team.points}}  {{team.played}}  {{team.won}}

             Draw           Lost                 GF                     GA
 0  {{team.draw}}  {{team.lost}}  {{team.goal_for}}  {{team.goal_against}}  ,
           Rank  Name                                        Name.1  \
 0  {{index+1}}   NaN  {{player.player_name}}  {{player.team_name}}

                     Goals
 0  {{player.total_goals}}  ,
               Season             Venue  \
 0  {{result.season}}  {{result.venue}}

                                               Winner  \
 0  {{result.winner_name}}  {{ result.joint_winner...

                                            Runner up
 0  {{ result.joint_winner != 1 ? result.runnerup_...  ]

In [168]:
df.to_excel(r"E:\blinkit_sales\blinkit_customers.xlsx")

In [167]:
pd.read_csv("https://raw.githubusercontent.com/dilshod/xlsx2csv/refs/heads/master/test/utf8.csv")

    à¸ªà¸§à¸±à¸ªà¸”à¸µ à¸„à¸£à¸±à¸š      Thai language
0         ã“ã‚“ã«ã¡ã¯  Japanese language
1  Ð—Ð´Ñ€Ð°Ð²ÑÑ‚Ð²ÑƒÐ¹Ñ‚Ðµ   Russian language
2        à¤¨à¤®à¤¸à¥à¤¤à¥‡              Hindi
3  Ø§Ù„Ø³Ù„Ø§Ù… Ø¹Ù„ÙŠÙƒÙ…             Arabic

### CSV Output

In [ ]:
df.to_csv(r'C:\Users\v-maheshkur\Downloads\example.csv',index=False)

## Excel
Pandas can read and write excel files, keep in mind, this only imports data. Not formulas or images, having images or macros may cause this read_excel method to crash.

### Excel Input

In [ ]:
pd.read_excel(r"C:\Users\v-maheshkur\Downloads\export (6).xlsx")

### Excel Output

In [ ]:
df

In [ ]:
sample_df = df.head(10)

In [ ]:
sample_df.to_excel(r'C:\Users\v-maheshkur\Downloads\Excel_Sample.xlsx',sheet_name='Sheet1')

## HTML

You may need to install htmllib5,lxml, and BeautifulSoup4. In your terminal/command prompt run:

    conda install lxml
    conda install html5lib
    conda install BeautifulSoup4

Then restart Jupyter Notebook.
(or use pip install if you aren't using the Anaconda Distribution)

Pandas can read table tabs off of html. For example:

### HTML Input

Pandas read_html function will read tables off of a webpage and return a list of DataFrame objects:

In [169]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [170]:
# len(df)
df

[                                            Bank Name                City  \
 0                        The Santa Anna National Bank          Santa Anna
 1                                Pulaski Savings Bank             Chicago
 2                  The First National Bank of Lindsay             Lindsay
 3               Republic First Bank dba Republic Bank        Philadelphia
 4                                       Citizens Bank            Sac City
 5                            Heartland Tri-State Bank             Elkhart
 6                                 First Republic Bank       San Francisco
 7                                      Signature Bank            New York
 8                                 Silicon Valley Bank         Santa Clara
 9                                   Almena State Bank              Almena
 10                         First City Bank of Florida   Fort Walton Beach
 11                               The First State Bank       Barboursville
 12                                 Ericson State Bank             Ericson
 13                   City National Bank of New Jersey              Newark
 14                                      Resolute Bank              Maumee
 15                              Louisa Community Bank              Louisa
 16                               The Enloe State Bank              Cooper
 17                Washington Federal Bank for Savings             Chicago
 18    The Farmers and Merchants State Bank of Argonia             Argonia
 19                                Fayette County Bank          Saint Elmo
 20  Guaranty Bank, (d/b/a BestBank in Georgia & Mi...           Milwaukee
 21                                     First NBC Bank         New Orleans
 22                                      Proficio Bank  Cottonwood Heights
 23                      Seaway Bank and Trust Company             Chicago
 24                             Harvest Community Bank          Pennsville

             State   Cert                Acquiring Institution  \
 0           Texas   5520            Coleman County State Bank
 1        Illinois  28611                      Millennium Bank
 2        Oklahoma   4134               First Bank & Trust Co.
 3    Pennsylvania  27332    Fulton Bank, National Association
 4            Iowa   8758            Iowa Trust & Savings Bank
 5          Kansas  25851               Dream First Bank, N.A.
 6      California  59017            JPMorgan Chase Bank, N.A.
 7        New York  57053                  Flagstar Bank, N.A.
 8      California  24735  First Citizens Bank & Trust Company
 9          Kansas  15426                          Equity Bank
 10        Florida  16748            United Fidelity Bank, fsb
 11  West Virginia  14361                       MVB Bank, Inc.
 12       Nebraska  18265           Farmers and Merchants Bank
 13     New Jersey  21111                      Industrial Bank
 14           Ohio  58317                   Buckeye State Bank
 15       Kentucky  58112    Kentucky Farmers Bank Corporation
 16          Texas  10716                   Legend Bank, N. A.
 17       Illinois  30570                   Royal Savings Bank
 18         Kansas  17719                          Conway Bank
 19       Illinois   1802            United Fidelity Bank, fsb
 20      Wisconsin  30003  First-Citizens Bank & Trust Company
 21      Louisiana  58302                         Whitney Bank
 22           Utah  35495                    Cache Valley Bank
 23       Illinois  19328                  State Bank of Texas
 24     New Jersey  34951  First-Citizens Bank & Trust Company

          Closing Date  Fund  Sort ascending
 0       June 27, 2025                 10549
 1    January 17, 2025                 10548
 2    October 18, 2024                 10547
 3      April 26, 2024                 10546
 4    November 3, 2023                 10545
 5       July 28, 2023                 10544
 6         May 1, 2023                 10543
 7      March 12, 2023                 10540
 8      March 10, 2023                 10539
 9    October 23, 2020                 10538
 10   October 16, 2020                 10537
 11      April 3, 2020                 10536
 12  February 14, 2020                 10535
 13   November 1, 2019                 10534
 14   October 25, 2019                 10533
 15   October 25, 2019                 10532
 16       May 31, 2019                 10531
 17  December 15, 2017                 10530
 18   October 13, 2017                 10529
 19       May 26, 2017                 10528
 20        May 5, 2017                 10527
 21     April 28, 2017                 10526
 22      March 3, 2017                 10525
 23   January 27, 2017                 10524
 24   January 13, 2017                 10523  ]

In [171]:
len(df)

1

In [172]:
df[0]

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund Sort ascending
0,The Santa Anna National Bank,Santa Anna,Texas,5520,Coleman County State Bank,"June 27, 2025",10549
1,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
2,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,First Bank & Trust Co.,"October 18, 2024",10547
3,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
4,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
5,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
6,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
7,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
8,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
9,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538
10,First City Bank of Florida,Fort Walton Beach,Florida,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
11,The First State Bank,Barboursville,West Virginia,14361,"MVB Bank, Inc.","April 3, 2020",10536
12,Ericson State Bank,Ericson,Nebraska,18265,Farmers and Merchants Bank,"February 14, 2020",10535
13,City National Bank of New Jersey,Newark,New Jersey,21111,Industrial Bank,"November 1, 2019",10534
14,Resolute Bank,Maumee,Ohio,58317,Buckeye State Bank,"October 25, 2019",10533
15,Louisa Community Bank,Louisa,Kentucky,58112,Kentucky Farmers Bank Corporation,"October 25, 2019",10532
16,The Enloe State Bank,Cooper,Texas,10716,"Legend Bank, N. A.","May 31, 2019",10531
17,Washington Federal Bank for Savings,Chicago,Illinois,30570,Royal Savings Bank,"December 15, 2017",10530
18,The Farmers and Merchants State Bank of Argonia,Argonia,Kansas,17719,Conway Bank,"October 13, 2017",10529
19,Fayette County Bank,Saint Elmo,Illinois,1802,"United Fidelity Bank, fsb","May 26, 2017",10528
20,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,Wisconsin,30003,First-Citizens Bank & Trust Company,"May 5, 2017",10527
21,First NBC Bank,New Orleans,Louisiana,58302,Whitney Bank,"April 28, 2017",10526
22,Proficio Bank,Cottonwood Heights,Utah,35495,Cache Valley Bank,"March 3, 2017",10525
23,Seaway Bank and Trust Company,Chicago,Illinois,19328,State Bank of Texas,"January 27, 2017",10524
24,Harvest Community Bank,Pennsville,New Jersey,34951,First-Citizens Bank & Trust Company,"January 13, 2017",10523

In [173]:
df[0].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 7 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Bank Name              25 non-null     object
 1   City                   25 non-null     object
 2   State                  25 non-null     object
 3   Cert                   25 non-null     int64
 4   Acquiring Institution  25 non-null     object
 5   Closing Date           25 non-null     object
 6   Fund  Sort ascending   25 non-null     int64
dtypes: int64(2), object(5)
memory usage: 1.5+ KB

In [174]:
df[0].describe(include='O')

,Bank Name,City,State,Acquiring Institution,Closing Date
count,25,25,25,25,25
unique,25,23,17,23,24
top,The Santa Anna National Bank,Chicago,Illinois,First-Citizens Bank & Trust Company,"October 25, 2019"
freq,1,3,4,2,2

____

_____
_____
# SQL (Optional)

The pandas.io.sql module provides a collection of query wrappers to both facilitate data retrieval and to reduce dependency on DB-specific API. Database abstraction is provided by SQLAlchemy if installed. In addition you will need a driver library for your database. Examples of such drivers are psycopg2 for PostgreSQL or pymysql for MySQL. For SQLite this is included in Pythonâ€™s standard library by default. You can find an overview of supported drivers for each SQL dialect in the SQLAlchemy docs.


If SQLAlchemy is not installed, a fallback is only provided for sqlite (and for mysql for backwards compatibility, but this is deprecated and will be removed in a future version). This mode requires a Python database adapter which respect the Python DB-API.

See also some cookbook examples for some advanced strategies.

The key functions are:

* read_sql_table(table_name, con[, schema, ...])	
    * Read SQL database table into a DataFrame.
* read_sql_query(sql, con[, index_col, ...])	
    * Read SQL query into a DataFrame.
* read_sql(sql, con[, index_col, ...])	
    * Read SQL query or database table into a DataFrame.
* DataFrame.to_sql(name, con[, flavor, ...])	
    * Write records stored in a DataFrame to a SQL database.

In [ ]:
from sqlalchemy import create_engine

In [ ]:
engine = create_engine('sqlite:///:memory:')

In [ ]:
df.set_index(keys="Index",inplace=True, drop=True)

In [ ]:
df.head()

In [ ]:
df.to_sql(r"C:\Users\v-maheshkur\Downloads\test.db",con=engine)

In [ ]:
df.to_sql('data', engine)

In [ ]:
pd.read_sql(r"C:\Users\v-maheshkur\Downloads\test.db",con=engine)

In [ ]:
sql_df = pd.read_sql('data',con=engine)

In [ ]:
sql_df

# Great Job!

# ---
# ðŸ“˜ Content from `Pandas_Seaborn_Detailed_Tutorial.ipynb`
# ---

# ðŸ“š Pandas & Seaborn for Beginners

Welcome to this beginner-friendly guide to **Pandas** and **Seaborn**.

We will:
- Learn what Pandas and Seaborn are
- Perform data analysis using Pandas
- Create beautiful visualizations using Seaborn
- Work on a mini-project

---

## 1. Introduction
**Pandas**: A Python library for working with tabular data (like Excel).
- Helps you store, clean, and analyze data easily.

**Seaborn**: A Python library for making attractive, easy-to-read charts.
- Built on top of Matplotlib.
- Especially good for statistical data visualization.

**Install them** (only run once):
```bash
pip install pandas seaborn
```

## ðŸ” Step-by-Step Learning Approach
We will break down each concept into **small, easy-to-digest steps**:
1. Learn the concept in plain English ðŸ—£ï¸
2. See the concept in action with code ðŸ’»
3. Practice it with a simple task âœï¸

---
### Understanding Data
Think of data like a table in Excel:
- **Rows** = individual entries (like each student in a class)
- **Columns** = properties/attributes (like name, age, score)
- **Index** = row number or label

### ðŸ“‚ Loading Data from Files
Pandas can read data from multiple sources:
- CSV files (`.csv`)
- Excel files (`.xlsx`)
- SQL databases

Example:
```python
df = pd.read_csv('data.csv')
df = pd.read_excel('data.xlsx')
```

In [ ]:
# Example: Creating data directly instead of reading from a file
sales_data = pd.DataFrame({
    'Product': ['Laptop', 'Mouse', 'Keyboard', 'Monitor', 'Laptop', 'Mouse'],
    'Price': [800, 20, 50, 150, 820, 18],
    'Quantity': [1, 5, 2, 3, 1, 10]
})

sales_data

### ðŸ“Š Calculating New Columns
We can create new columns by doing math on existing ones.

In [ ]:
sales_data['Total'] = sales_data['Price'] * sales_data['Quantity']
sales_data

### ðŸ”„ Sorting Data
We can sort data by column values.
```python
df.sort_values('column_name', ascending=False)
```

In [ ]:
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [ ]:
sales_data.sort_values('Total', ascending=False)

## ðŸŽ¨ More Seaborn Plots
Seaborn has many types of plots for different purposes:
- **countplot** â†’ counts how many times each category appears
- **barplot** â†’ shows average values for each category
- **lineplot** â†’ shows trends over time
- **heatmap** â†’ shows correlation between variables

In [ ]:
# Countplot example
sns.countplot(x='Product', data=sales_data)
plt.title('Product Frequency')
plt.show()

# Barplot example
sns.barplot(x='Product', y='Total', data=sales_data)
plt.title('Average Total Sales per Product')
plt.show()

## ðŸ† Practice Task for Students
**Task:**
1. Create a DataFrame with columns: `City`, `Population`, `Area`, `GDP`.
2. Calculate GDP per capita.
3. Sort cities by GDP per capita.
4. Create a barplot showing GDP per capita for each city.

This will help you apply Pandas and Seaborn together.

In [ ]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

# Make Seaborn look nice
sns.set_theme()
print("Libraries loaded successfully âœ…")

## 2. Pandas Basics

### 2.1 Creating DataFrames
DataFrames are like Excel sheets with rows and columns.

In [ ]:
# Create DataFrame from dictionary
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'Score': [85, 90, 88, 92]
}
df = pd.DataFrame(data)
df

### 2.2 Viewing and Exploring Data

In [ ]:
df.head()  # First 5 rows
df.info()  # Summary
df.describe()  # Statistics

### 2.3 Selecting Data

In [ ]:
df['Name']  # Single column
df[['Name', 'Score']]  # Multiple columns
df.loc[0]  # Row by label
df.iloc[1]  # Row by position

### 2.4 Filtering Data

In [ ]:
df[df['Score'] > 88]

### 2.5 Grouping Data

In [ ]:
# Example: Group by Age category
df.groupby('Age')['Score'].mean()

## 3. Seaborn Basics

In [ ]:
# Sample data
tips = sns.load_dataset('tips')
tips.head()

In [ ]:
# Histogram
sns.histplot(tips['total_bill'], kde=True)
plt.show()

# Scatter plot
sns.scatterplot(x='total_bill', y='tip', data=tips)
plt.show()

# Box plot
sns.boxplot(x='day', y='total_bill', data=tips)
plt.show()

## 4. Mini Project: Student Performance

In [ ]:
student_data = pd.DataFrame({
    'Name': ['A', 'B', 'C', 'D', 'E', 'F'],
    'Hours_Studied': [5, 3, 8, 2, 6, 4],
    'Attendance': [90, 80, 95, 70, 85, 88],
    'Marks': [85, 75, 90, 60, 88, 82]
})

# Summary statistics
print(student_data.describe())

# Visualization: Hours vs Marks
sns.scatterplot(x='Hours_Studied', y='Marks', data=student_data)
plt.title('Study Hours vs Marks')
plt.show()

# Heatmap for correlations
sns.heatmap(student_data.corr(), annot=True, cmap='coolwarm')
plt.title('Correlation Heatmap')
plt.show()

## 5. Summary
- **Pandas**: For data manipulation and analysis
- **Seaborn**: For easy and attractive visualizations
- Practice is key â€” try loading your own datasets and exploring them!

ðŸŽ¯ Happy Learning!